Tests/bat/5.6/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="http://www.example.org/NewWSDLFile/">
   <soapenv:Header/>
   <soapenv:Body>
      <new:NewOperation>
         <in>yahoo</in>
      </new:NewOperation>
   </soapenv:Body>
</soapenv:Envelope>