integration_tests/integration_test_dev/target/surefire-reports/TestSuite_1-TestCase_1-SOAP_Request-0-FAILED.txt

Status: FAILED
Time Taken: 1639
Size: 0
Timestamp: Fri May 19 07:44:16 CDT 2017
TestStep: SOAP Request

----------------- Messages ------------------------------
org.apache.http.conn.HttpHostConnectException: Connection to http://96.90.100.116:7800 refused

----------------- Properties ------------------------------
Endpoint: http://96.90.100.116:7800/
Encoding: UTF-8

---------------- Request ---------------------------
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="http://www.example.org/NewWSDLFile/">
   <soapenv:Header/>
   <soapenv:Body>
      <new:NewOperation>
         <in>AoA</in>
      </new:NewOperation>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
- missing response / garbage collected -
